{
  "backend/main.mo": "Motoko actor that manages contact inquiries with CRUD operations (submit, get all, get by ID, delete) using a Map store and auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (language selection, hero section, classes section, contact form) to their corresponding source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence descriptions of each frontend source file, serving as a reference summary for the project's frontend components and utilities.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, primary, destructive, etc.).",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to the school name and mounting the app at the root div via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app in LanguageProvider and renders all page sections (Hero, About, Classes, Contact, Footer) with smooth scroll navigation via section refs.",
  "frontend/src/components/AboutSection.tsx": "Renders the About section with a title, description, and two cards displaying the school's Mission and Vision in the selected language.",
  "frontend/src/components/ClassCard.tsx": "Reusable card component displaying a single class's name, age range, description, highlight, and subjects with per-index color theming.",
  "frontend/src/components/ClassesSection.tsx": "Renders the Classes section with a heading and a responsive grid of ClassCard components for all five classes using translated data.",
  "frontend/src/components/ContactForm.tsx": "React Hook Form-based contact form with fields for name, email, phone, subject, and message; submits to the backend canister and shows a success confirmation state.",
  "frontend/src/components/ContactSection.tsx": "Renders the contact section with address, phone, and hours info cards alongside the ContactForm component in a two-column layout.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with school info, quick navigation links, contact details, copyright, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky header with school logo, desktop and mobile navigation menus, and a language toggle button.",
  "frontend/src/components/Hero.tsx": "Hero section displaying a banner image with overlay text, a tagline, subtitle, and CTA buttons for classes and contact navigation.",
  "frontend/src/components/LanguageModal.tsx": "Full-screen modal shown on first visit prompting the user to select English or Hindi as their preferred language.",
  "frontend/src/components/LanguageToggle.tsx": "Small toggle button in the header that switches the app language between English and Hindi.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider that manages the selected language state, persisting the choice to sessionStorage.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider that manage Internet Identity authentication via AuthClient, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines a `useSubmitContactInquiry` mutation hook that submits contact form data to the backend actor and invalidates the `contactInquiries` query cache on success.",
  "frontend/src/hooks/useTranslation.ts": "Provides a `useTranslation` hook that returns the current language's translation object and language code from the LanguageContext.",
  "frontend/src/i18n/translations.ts": "Defines TypeScript interfaces for translation data and exports English and Hindi translation objects covering nav, hero, about, classes, contact, footer, and language-selection UI strings.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for the warm saffron/green/cream color theme in light and dark modes, and adds utility classes for school-specific colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider, InternetIdentityProvider, and the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom school fonts (Playfair Display, Noto Sans), saffron/green/cream color palette, border radii, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing the multilingual school website for Dwarika Mohini Medha Montesary School, listing implemented features, architectural notes, image requirements, and known issues."
}